#include <stdio.h>
#include <stdlib.h>
#define asize 10                 //กำหนดค่าคงที่ 10
int main()
{
    //int a[10];     
    // การประกาศ array a[10]  10 คือ size
    // array a[10] จะมีเริ่มที่ a[0] - a[9]  ไม่มี a[10]

    //int a[10] = {1,2,3,4,5,6};
    //ตัวที่เหลือมีค่าเป็น 0   

    //int z[] = {1,2,3,4,5};       
    //การสร้าง array ขนาด 5

    int a[asize] = {1,2,3,4,5,6};          //ตัวที่เหลือมีค่าเป็น 0  
    int b[10] = {0};
    int i;

    for(i = 0 ; i < asize ; i++)
    {
        printf("a[%d] = %d\n",i,a[i]);
    }
    //วนloopเพื่อปริ้นค่าข้างใน array มาดู
    //คำตอบตั้งแต่ a[6] - a[9] = 0
    printf("\n");

    int s[2][2] = {{1,2},{3,4}};            //array 2D
    int s1[2][2] = {1,2,3,4};               //s มีค่าเท่ากับ s1
    int i1,j1;

    for (i1=0;i1<2;i1++)
    {
        for (j1=0;j1<2;j1++)
        {
            printf("%d ",s[i1][j1]);
        }
        printf("\n");
    }
    printf("\n");
    //ปริ้น array 2D ให้ออกมาในรูปแบบ 2D
    /*int s[][] = {{1,2},{3,4}};            ทำแบบนี้ไม่ได้*/
    /*int s[][2] = {{1,2},{3,4}};           ทำแบบนี้ได้*/
}